AUTO_config_TK_pesok/src/ExchangePlans/ОбменМобильноеПриложение/ОбменМобильноеПриложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="8320455f-f870-4741-99f6-b997aa09d118">
  <name>ОбменМобильноеПриложение</name>
  <attributes>
    <name>ПрофильНастроек</name>
    <type>
      <types>CatalogRef.НастройкиМобильногоПриложения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладАгента</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Роли</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.РолиМобильногоПриложения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

AUTO_config_TK_pesok/src/Enums/ЗначениеРоли/ЗначениеРоли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗначениеРоли</name>
  <enumValues>
    <name>Включена</name>
  </enumValues>
  <enumValues>
    <name>Выключена</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Enums/РолиМобильногоПриложения/РолиМобильногоПриложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиМобильногоПриложения</name>
  <enumValues>
    <name>ПреселенгИспользование</name>
  </enumValues>
  <enumValues>
    <name>ВэнселингИспользование</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/ExchangePlans/ОбменМобильноеПриложение/Forms/ФормаУзла/Module.bsl
&НаСервере
Функция ТекстСериализации()
	
	НомерСообщенияОчереди = 0;
	//
	ЗаписьСообщения = Неопределено;
	ЗаписьXML = ОбменМобильноеПриложение.ПолучитьЗаписьXMLДляСообщенияОбмена(Объект.Ссылка, ЗаписьСообщения);
	
	ВозвращаемыйСписок = ОбменМобильноеПриложение.СоздатьОбъектXDTO("Objects");
	
	КоличествоОбъектов = 0; // Счетчик объектов.
	
	
	СоставПлана = Метаданные.ПланыОбмена.ОбменМобильноеПриложение.Состав;
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Узел",Объект.Ссылка);
	
	Для Каждого Состав Из СоставПлана Цикл
		
		Если  ОбщегоНазначения.ЭтоСправочник(Состав.Метаданные) Тогда
			ТекстЗапроса = "ВЫБРАТЬ
			|	Спр.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник."+Состав.Метаданные.Имя+".Изменения КАК Спр
			|ГДЕ
			|	Спр.Узел = &Узел";
		ИначеЕсли ОбщегоНазначения.ЭтоРегистрСведений(Состав.Метаданные) Тогда
			
			 Продолжить;
			
		Иначе
			Продолжить;
		КонецЕсли;
		
		Запрос.Текст  = ТекстЗапроса;
		Рез =  Запрос.Выполнить();
		Выборка = Рез.Выбрать();
		
		Пока Выборка.Следующий() Цикл 
			ОбъектXDTO = ОбменМобильноеПриложение.ПолучитьОбъектXDTO(Выборка.Ссылка, КоличествоОбъектов);
			Если ОбъектXDTO <> Неопределено Тогда
				ВозвращаемыйСписок.objects.Добавить(ОбъектXDTO);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
		
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ВозвращаемыйСписок);
	
	ЗаписьСообщения.ЗакончитьЗапись();
	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку(ЗаписьXML.Закрыть());
	
	Возврат Текст;
КонецФункции

&НаКлиенте
Процедура ПоказатьРезультатВыгрузки(Команда)
	Текст =  ТекстСериализации();
	ЗаголовокТекста = НСтр("ru='Результат стандартной выгрузки (МП)';uk='Результат стандартного вивантаження (МП)'");
	Текст.Показать(ЗаголовокТекста);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПриСоздании();
	
	Если СформироватьQR_Код Тогда
		СформироватьQR();
	КонецЕсли;

	
	Преселенг = Перечисления.ЗначениеРоли.Выключена;
	Вэнселинг = Перечисления.ЗначениеРоли.Выключена; 
	
	Для Каждого ТекСтрока Из Объект.Роли Цикл 
		Если ТекСтрока.Роль = Перечисления.РолиМобильногоПриложения.ВэнселингИспользование Тогда
			Вэнселинг = Перечисления.ЗначениеРоли.Включена;
		ИначеЕсли ТекСтрока.Роль = Перечисления.РолиМобильногоПриложения.ПреселенгИспользование Тогда
			Преселенг = Перечисления.ЗначениеРоли.Включена;
		КонецЕсли;
	КонецЦикла;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Роли.Очистить();
	
	Если Вэнселинг = ПредопределенноеЗначение("Перечисление.ЗначениеРоли.Включена") Тогда
		ДобавитьРольВТаблицу(ПредопределенноеЗначение("Перечисление.РолиМобильногоПриложения.ВэнселингИспользование"));
	КонецЕсли;
	Если Преселенг = ПредопределенноеЗначение("Перечисление.ЗначениеРоли.Включена") Тогда
		ДобавитьРольВТаблицу(ПредопределенноеЗначение("Перечисление.РолиМобильногоПриложения.ПреселенгИспользование"));
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРольВТаблицу(Роль)
	
	НоваяСтрока = Объект.Роли.Добавить();
	НоваяСтрока.Роль = Роль;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриСоздании()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СформироватьQR_Код = Истина;	
		
	Иначе
		СформироватьQR_Код = Ложь;
		 //Новый объект 
		Объект.Пользователь = Параметры.Пользователь;
		Объект.Наименование = Параметры.Пользователь.Наименование;
		Объект.Код = Объект.Пользователь.ИдентификаторПользователяИБ;
	КонецЕсли;
	Элементы.Группа5.Видимость = НЕ СформироватьQR_Код;
	Элементы.Группа6.Видимость = СформироватьQR_Код;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если Не СформироватьQR_Код Тогда
		СформироватьQR();
	Конецесли;

КонецПроцедуры


&НаСервере
Процедура СформироватьQR()
	УстановитьПривилегированныйРежим(Истина);	
	СтруктураВозврата = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.Пользователь.ИдентификаторПользователяИБ);
	Если НЕ СтруктураВозврата = Неопределено Тогда
		
		QRСтрока = "sbmcs" + ";"  +Объект.Код + ";1web.digma.ua;TK_MobileAgent;tru;" + СтруктураВозврата.Имя; 
		ДанныеQRКода = УправлениеПечатью.ДанныеQRКода(QRСтрока, 0, 190);
		QRКод = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);
		ЗаполнитьПриСоздании();
	КонецЕсли;

КонецПроцедуры
